pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
      </registers>
    </peripheral>
    <!--AES AES Keys.-->
    <peripheral>
      <name>CRC</name>
      <description>CRC Registers.</description>
      <baseAddress>0x4000F000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>CRC Control</description>
          <addressOffset>0x0000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>CRC Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_EN</name>
              <description>DMA Request Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MSB</name>
              <description>MSB Select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE_SWAP_IN</name>
              <description>Byte Swap CRC Data Input</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE_SWAP_OUT</name>
              <description>Byte Swap CRC Value Output</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>CRC Busy</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAIN32</name>
          <description>CRC Data Input</description>
          <addressOffset>0x0004</addressOffset>
          <fields>
            <field>
              <name>DATA</name>
              <description>CRC Data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>2</dimIncrement>
          <name>DATAIN16[%s]</name>
          <description>CRC Data Input</description>
          <addressOffset>0x0004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>CRC Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>1</dimIncrement>
          <name>DATAIN8[%s]</name>
          <description>CRC Data Input</description>
          <addressOffset>0x0004</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>CRC Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POLY</name>
          <description>CRC Polynomial</description>
          <addressOffset>0x0008</addressOffset>
          <fields>
            <field>
              <name>POLY</name>
              <description>CRC Polynomial</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAL</name>
          <description>Current CRC Value</description>
          <addressOffset>0x000C</addressOffset>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Current CRC Value</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--CRC CRC Registers.-->
    <peripheral>
      <name>FCR</name>
      <description>Function Control Register.</description>
      <baseAddress>0x40000800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FCTRL0</name>
          <description>Register 0.</description>
          <addressOffset>0x00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERFO_RANGE_SEL</name>
              <description>14MHz-32MHz ERFO Frequency Range Select.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>I2C0_SDA_FILTER_EN</name>
              <description>I2C0 SDA Glitch Filter Enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C0_SCL_FILTER_EN</name>
              <description>I2C0 SCL Glitch Filter Enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1_SDA_FILTER_EN</name>
              <description>I2C1 SDA Glitch Filter Enable.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1_SCL_FILTER_EN</name>
              <description>I2C1 SCL Glitch Filter Enable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C2_SDA_FILTER_EN</name>
              <description>I2C2 SDA Glitch Filter Enable.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C2_SCL_FILTER_EN</name>
              <description>I2C2 SCL Glitch Filter Enable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCAL0</name>
          <description>Register 1.</description>
          <addressOffset>0x04</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEL</name>
              <description>Auto-calibration Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>Autocalibration Run.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>run</name>
                  <description>Running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOAD</name>
              <description>Load Trim.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVERT</name>
              <description>Invert Gain.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>run</name>
                  <description>Running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ATOMIC</name>
              <description>Atomic mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Not Running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>run</name>
                  <description>Running.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GAIN</name>
              <description>MU value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>TRIM</name>
              <description>150MHz HFIO Auto Calibration Trim</description>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCAL1</name>
          <description>Register 2.</description>
          <addressOffset>0x08</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INITIAL</name>
              <description>100MHz IPO Trim Automatic Calibration Initial Trim.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCAL2</name>
          <description>Register 3.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RUNTIME</name>
              <description>100MHz IPO Trim Automatic Calibration Run Time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DIV</name>
              <description>100MHz IPO Trim Automatic Calibration Divide Factor.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
