pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
      </registers>
    </peripheral>
    <!--FCR Function Control Register.-->
    <peripheral>
      <name>MCR</name>
      <description>Misc Control.</description>
      <baseAddress>0x40106C00</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RST</name>
          <description>Reset Control Register</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <field>
              <name>LPTMR0</name>
              <description>Low Power Timer0 Reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTMR1</name>
              <description>Low Power Timer1 Reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART0</name>
              <description>Low Power UART0 Reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIS</name>
          <description>Low Power Peripheral Clock Disable.</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>LPTMR0</name>
              <description>Low Power Timer0 Clock Disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTMR1</name>
              <description>Low Power Timer1 Clock Disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART0</name>
              <description>Low Power UART0 Clock Disable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--MCR Misc Control.-->
    <peripheral>
      <name>DMA</name>
      <description>DMA Controller Fully programmable, chaining capable DMA channels.</description>
      <baseAddress>0x40028000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>DMA1</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>DMA2</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>DMA3</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>DMA4</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>DMA5</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>DMA6</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>DMA7</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>DMA8</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>DMA9</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>DMA10</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>DMA11</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>DMA12</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>DMA13</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>DMA14</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>DMA15</name>
        <value>79</value>
      </interrupt>
      <registers>
        <register>
          <name>INTEN</name>
          <description>DMA Control Register.</description>
          <addressOffset>0x000</addressOffset>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 Interrupt Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="CH0">
              <name>CH1</name>
              <description>Channel 1 Interrupt Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH2</name>
              <description>Channel 2 Interrupt Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH3</name>
              <description>Channel 3 Interrupt Enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH4</name>
              <description>Channel 4 Interrupt Enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH5</name>
              <description>Channel 5 Interrupt Enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH6</name>
              <description>Channel 6 Interrupt Enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH7</name>
              <description>Channel 7 Interrupt Enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFL</name>
          <description>DMA Interrupt Register.</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel Interrupt. To clear an interrupt, all active interrupt bits of the DMA_ST must be cleared. The interrupt bits are set only if their corresponding interrupt enable bits are set in DMA_CN.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="CH0">
              <name>CH1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="CH0">
              <name>CH7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
