pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
          <register>
            <name>DST</name>
            <description>Destination Device Address. For peripheral transfers, some or all of the actual address bits are fixed. If DSTINC=1, this register is incremented on every AHB write out of the DMA FIFO. They are incremented by 1, 2, or 4, depending on the data width of each AHB cycle. In the case where a count-to-zero condition occurs while RLDEN=1, the register is reloaded with DMA_DST_RLD.</description>
            <addressOffset>0x10C</addressOffset>
            <fields>
              <field>
                <name>ADDR</name>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT</name>
            <description>DMA Counter. The user loads this register with the number of bytes to transfer. This counter decreases on every AHB cycle into the DMA FIFO. The decrement will be 1, 2, or 4 depending on the data width of each AHB cycle. When the counter reaches 0, a count-to-zero condition is triggered.</description>
            <addressOffset>0x110</addressOffset>
            <fields>
              <field>
                <name>CNT</name>
                <description>DMA Counter.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>SRCRLD</name>
            <description>Source Address Reload Value. The value of this register is loaded into DMA0_SRC upon a count-to-zero condition.</description>
            <addressOffset>0x114</addressOffset>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Source Address Reload Value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>31</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DSTRLD</name>
            <description>Destination Address Reload Value. The value of this register is loaded into DMA0_DST upon a count-to-zero condition.</description>
            <addressOffset>0x118</addressOffset>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Destination Address Reload Value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>31</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CNTRLD</name>
            <description>DMA Channel Count Reload Register.</description>
            <addressOffset>0x11C</addressOffset>
            <fields>
              <field>
                <name>CNT</name>
                <description>Count Reload Value. The value of this register is loaded into DMA0_CNT upon a count-to-zero condition.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
              <field>
                <name>EN</name>
                <description>Reload Enable. This bit should be set after the address reload registers have been programmed. This bit is automatically cleared to 0 when reload occurs.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>dis</name>
                    <description>Disable.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>en</name>
                    <description>Enable.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <!--DMA DMA Controller Fully programmable, chaining capable DMA channels.-->
    <peripheral>
      <name>FLC</name>
      <description>Flash Memory Control.</description>
      <prependToName>FLSH_</prependToName>
      <baseAddress>0x40029000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>Flash_Controller</name>
        <description>Flash Controller interrupt.</description>
        <value>23</value>
      </interrupt>
      <registers>
        <register>
          <name>ADDR</name>
          <description>Flash Write Address.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address for next operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <description>Flash Clock Divide. The clock (PLL0) is divided by this value to generate a 1 MHz clock for Flash controller.</description>
          <addressOffset>0x04</addressOffset>
          <resetValue>0x00000064</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Flash Clock Divide. The clock is divided by this value to generate a 1MHz clock for flash controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Flash Control Register.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>WR</name>
              <description>Write.  This bit is automatically cleared after the operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="WR">
              <name>ME</name>
              <description>Mass Erase.  This bit is automatically cleared after the operation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="WR">
              <name>PGE</name>
              <description>Page Erase.  This bit is automatically cleared after the operation.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDTH</name>
              <description>Data Width.  This bits selects write data width.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>size128</name>
                  <description>128-bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size32</name>
                  <description>32-bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERASE_CODE</name>
              <description>Erase Code.  The ERASE_CODE must be set up property before erase operation can be initiated. These bits are automatically cleared after the operation is complete.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>erasePage</name>
                  <description>Enable Page Erase.</description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>eraseAll</name>
                  <description>Enable Mass Erase. The debug port must be enabled.</description>
                  <value>0xAA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEND</name>
              <description>Flash Pending.  When Flash operation is in progress (busy), Flash reads and writes will fail. When PEND is set, write to all Flash registers, with exception of the Flash interrupt register, are ignored.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle</name>
                  <description>Idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Busy.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVE</name>
              <description>Low Voltage enable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Flash Unlock.  The correct unlock code must be written to these four bits before any Flash write or erase operation is allowed.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>unlocked</name>
                  <description>Flash Unlocked.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>locked</name>
                  <description>Flash Locked.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Flash Interrupt Register.</description>
          <addressOffset>0x024</addressOffset>
          <fields>
            <field>
              <name>DONE</name>
              <description>Flash Done Interrupt.  This bit is set to 1 upon Flash write or erase completion.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AF</name>
              <description>Flash Access Fail.  This bit is set when an attempt is made to write the flash while the flash is busy or the flash is locked. This bit can only be set to 1 by hardware.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noError</name>
                  <description>No Failure.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>error</name>
                  <description>Failure occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONEIE</name>
              <description>Flash Done Interrupt Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="DONEIE">
              <name>AFIE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCDATA</name>
          <description>ECC Data Register.</description>
          <addressOffset>0x028</addressOffset>
          <fields>
            <field>
              <name>EVEN</name>
              <description>Error Correction Code Odd Data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>ODD</name>
              <description>Error Correction Code Even Data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>DATA</name>
          <description>Flash Write Data.</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data next operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTRL</name>
          <description>Access Control Register. Writing the ACTRL register with the following values in the order shown, allows read and write access to the system and user Information block:
    pflc-actrl = 0x3a7f5ca3;
    pflc-actrl = 0xa1e34f20;
    pflc-actrl = 0x9608b2c1. When unlocked, a write of any word will disable access to system and user information block. Readback of this register is always zero.</description>
          <addressOffset>0x40</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ACTRL</name>
              <description>Access control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WELR0</name>
          <description>WELR0</description>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>WELR0</name>
              <description>Access control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WELR1</name>
          <description>WELR1</description>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>WELR1</name>
              <description>Access control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR0</name>
          <description>RLR0</description>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>RLR0</name>
              <description>Access control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR1</name>
          <description>RLR1</description>
          <addressOffset>0x98</addressOffset>
          <fields>
            <field>
              <name>RLR1</name>
              <description>Access control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
