pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
        <register>
          <name>PM</name>
          <description>Power Management.</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <field>
              <name>MODE</name>
              <description>Operating Mode. This two bit field selects the current operating mode for the device. Note that code execution only occurs during ACTIVE mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Active Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>backup</name>
                  <description>Backup Mode.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_WE</name>
              <description>GPIO Wake Up Enable. This bit enables all GPIO pins as potential wakeup sources. Any GPIO configured for wakeup is capable of causing an exit from IDLE or STANDBY modes when this bit is set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Wake Up Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Wake Up Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="GPIO_WE">
              <name>RTC_WE</name>
              <description>RTC Alarm Wake Up Enable. This bit enables RTC alarm as wakeup source. If enabled, the desired RTC alarm must be configured via the RTC control registers.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO_WE">
              <name>LPTMR0_WE</name>
              <description>TIMER4 Wake Up Enable. This bit enables TIMER4 as wakeup source. </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO_WE">
              <name>LPTMR1_WE</name>
              <description>TIMER5 Wake Up Enable. This bit enables TIMER5 as wakeup source. </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO_WE">
              <name>LPUART0_WE</name>
              <description>LPUART3 Wake Up Enable. This bit enables LPUART3 as wakeup source. </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERFO_PD</name>
              <description>32MHz power down. This bit selects 32MHz Crystal power state in DEEPSLEEP mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Mode is Active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>deepsleep</name>
                  <description>Powered down in DEEPSLEEP.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="ERFO_PD">
              <name>IPO_PD</name>
              <description>96MHz power down. This bit selects 96MHz HIRC power state in DEEPSLEEP mode. </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="ERFO_PD">
              <name>IBRO_PD</name>
              <description>8MHz power down. This bit selects 8MHz HIRC power state in DEEPSLEEP mode. </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERFO_BP</name>
              <description>32MHz Oscillator Bypass</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKDIV</name>
          <description>Peripheral Clock Divider.</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>AON_CLKDIV</name>
              <description>Always-ON (AON) domain Clock Divider. These bits define the AON domain clock divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div4</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIV_CLK_OUT_CTRL</name>
              <description>DIV_CLK_OUT Control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DIV_CLK_OUT_EN</name>
              <description>DIV_CLK_OUT Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKDIS0</name>
          <description>Peripheral Clock Disable.</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIO0</name>
              <description>GPIO0 Disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable it.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disable it.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="GPIO0">
              <name>GPIO1</name>
              <description>GPIO1 Disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>DMA</name>
              <description>DMA Disable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>SPI0</name>
              <description>SPI 0 Disable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>SPI1</name>
              <description>SPI 1 Disable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>SPI2</name>
              <description>SPI 2 Disable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>UART0</name>
              <description>UART 0 Disable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>UART1</name>
              <description>UART 1 Disable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>I2C0</name>
              <description>I2C 0 Disable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>TMR0</name>
              <description>Timer 0 Disable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>TMR1</name>
              <description>Timer 1 Disable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>TMR2</name>
              <description>Timer 2 Disable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>TMR3</name>
              <description>Timer 3 Disable.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="GPIO0">
              <name>I2C1</name>
              <description>I2C 1 Disable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMCTRL</name>
          <description>Memory Clock Control Register.</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>FWS</name>
              <description>Flash Wait State. These bits define the number of wait-state cycles per Flash data read access. Minimum wait state is 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RAMWS_EN</name>
              <description>System RAM Wait State enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAM0LS_EN</name>
              <description>System RAM 0 Light Sleep Mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>RAM is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>RAM is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RAM0LS_EN">
              <name>RAM1LS_EN</name>
              <description>System RAM 1 Light Sleep Mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="RAM0LS_EN">
              <name>RAM2LS_EN</name>
              <description>System RAM 2 Light Sleep Mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="RAM0LS_EN">
              <name>RAM3LS_EN</name>
              <description>System RAM 3 Light Sleep Mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="RAM0LS_EN">
              <name>ICC0LS_EN</name>
              <description>ICache RAM Light Sleep Mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="RAM0LS_EN">
              <name>ROMLS_EN</name>
              <description>ROM Light Sleep Mode.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMZ</name>
          <description>Memory Zeroize Control.</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>RAM</name>
              <description>System RAM Block.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="RAM">
              <name>RAMCB</name>
              <description>System RAM check bit zeroization.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="RAM">
              <name>ICC0</name>
              <description>Instruction Cache.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSST</name>
          <description>System Status Register.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>ICELOCK</name>
              <description>ARM ICE Lock Status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>unlocked</name>
                  <description>ICE is unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>locked</name>
                  <description>ICE is locked.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RST1</name>
          <description>Reset 1.</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>I2C1</name>
              <description>I2C1 Reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>reset_read</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Starts reset or indicates reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="I2C1">
              <name>WDT1</name>
              <description>WDT1 Reset.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="I2C1">
              <name>CRC</name>
              <description>CRC Reset.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="I2C1">
              <name>AES</name>
              <description>AES Reset.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="I2C1">
              <name>AC</name>
              <description>AC Reset.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="I2C1">
              <name>I2C2</name>
              <description>I2C2 Reset.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="I2C1">
              <name>I2S</name>
              <description>I2S Reset.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLKDIS1</name>
          <description>Peripheral Clock Disable.</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>UART2</name>
              <description>UART2 Disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="UART2">
              <name>TRNG</name>
              <description>TRNG Disable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="UART2">
              <name>WWDT0</name>
              <description>WDT0  Disable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="UART2">
              <name>WWDT1</name>
              <description>WDT1  Disable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="UART2">
              <name>ICC0</name>
              <description>ICACHE Disable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="UART2">
              <name>CRC</name>
              <description>CRC Disable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="UART2">
              <name>AES</name>
              <description>AES Disable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="UART2">
              <name>I2C2</name>
              <description>I2C2 Disable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="UART2">
              <name>I2S</name>
              <description>I2S Clock Disable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTEN</name>
          <description>Event Enable Register.</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>DMA</name>
              <description>Enable DMA event. When this bit is set, a DMA event will cause an RXEV event to wake the CPU from WFE sleep mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX</name>
              <description>Enable RXEV pin event. When this bit is set, a logic high of GPIO0[20] will cause an RXEV event to wake the CPU from WFE sleep mode. </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX</name>
              <description>Enable TXEV pin event. When this bit is set, TXEV event from the CPU is output to GPIO[21].</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REVISION</name>
          <description>Revision Register.</description>
          <addressOffset>0x50</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Manufacturer Chip Revision. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSIE</name>
          <description>System Status Interrupt Enable Register.</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>ICEUNLOCK</name>
              <description>ARM ICE Unlock Interrupt Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCERR</name>
          <description>ECC Error Register</description>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>RAM</name>
              <description>ECC System RAM0 Error Flag. Write 1 to clear.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICC0</name>
              <description>ECC Icache Error Flag. Write 1 to clear.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASH</name>
              <description>ECC Flash Error Flag. Write 1 to clear.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
