pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
        <register>
          <name>ECCCED</name>
          <description>ECC Not Double Error Detect Register</description>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>RAM</name>
              <description>ECC System RAM0 Error Flag. Write 1 to clear.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICC0</name>
              <description>ECC Icache Not Double Error Detect. Write 1 to clear.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASH</name>
              <description>ECC Flash0 Not Double Error Detect. Write 1 to clear.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCIE</name>
          <description>ECC IRQ Enable Register</description>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>RAM</name>
              <description>ECC System RAM0 Error Interrup Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICC0</name>
              <description>ECC Icache0 Error Interrup Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASH</name>
              <description>ECC Flash0 NError Interrup Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCADDR</name>
          <description>ECC Error Address Register</description>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>DATARAMADDR</name>
              <description>ECC Error Address/TAG RAM Error Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>DATARAMBANK</name>
              <description>ECC Error Address/DATA RAM Error Bank.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATARAMERR</name>
              <description>ECC Error Address/DATA RAM Error Address.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAGRAMADDR</name>
              <description>ECC Error Address/TAG RAM Error Address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>TAGRAMBANK</name>
              <description>ECC Error Address/TAG RAM Error Bank.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAGRAMERR</name>
              <description>ECC Error Address/TAG RAM Error.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--GCR Global Control Registers.-->
    <peripheral>
      <name>GPIO0</name>
      <description>Individual I/O for each GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO0</name>
        <description>GPIO0 interrupt.</description>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>EN0</name>
          <description>GPIO Function Enable Register. Each bit controls the GPIO_EN setting for one GPIO pin on the associated port.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field>
              <name>GPIO_EN</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALTERNATE</name>
                  <description>Alternate function enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>GPIO function is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EN0_SET</name>
          <description>GPIO Set Function Enable Register. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_EN to 1, without affecting other bits in that register.</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EN0_CLR</name>
          <description>GPIO Clear Function Enable Register. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_EN to 0, without affecting other bits in that register.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTEN</name>
          <description>GPIO Output Enable Register. Each bit controls the GPIO_OUT_EN setting for one GPIO pin in the associated port.</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>GPIO Output Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>GPIO Output Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTEN_SET</name>
          <description>GPIO Output Enable Set Function Enable Register. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_OUT_EN to 1, without affecting other bits in that register.</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTEN_CLR</name>
          <description>GPIO Output Enable Clear Function Enable Register. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_OUT_EN to 0, without affecting other bits in that register.</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT</name>
          <description>GPIO Output Register. Each bit controls the GPIO_OUT setting for one pin in the associated port.  This register can be written either directly, or by using the GPIO_OUT_SET and GPIO_OUT_CLR registers.</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>GPIO_OUT</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Drive Logic 0 (low) on GPIO output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>Drive logic 1 (high) on GPIO output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_SET</name>
          <description>GPIO Output Set. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_OUT to 1, without affecting other bits in that register.</description>
          <addressOffset>0x1C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>GPIO_OUT_SET</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <description>No Effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>set</name>
                  <description>Set GPIO_OUT bit in this position to '1'</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CLR</name>
          <description>GPIO Output Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_OUT to 0, without affecting other bits in that register.</description>
          <addressOffset>0x20</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>GPIO_OUT_CLR</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IN</name>
          <description>GPIO Input Register. Read-only register to read from the logic states of the GPIO pins on this port.</description>
          <addressOffset>0x24</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>GPIO_IN</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTMODE</name>
          <description>GPIO Interrupt Mode Register. Each bit in this register controls the interrupt mode setting for the associated GPIO pin on this port.</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>GPIO_INTMODE</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>level</name>
                  <description>Interrupts for this pin are level triggered.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edge</name>
                  <description>Interrupts for this pin are edge triggered.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPOL</name>
          <description>GPIO Interrupt Polarity Register. Each bit in this register controls the interrupt polarity setting for one GPIO pin in the associated port.</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>GPIO_INTPOL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>falling</name>
                  <description>Interrupts are latched on a falling edge or low level condition for this pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rising</name>
                  <description>Interrupts are latched on a rising edge or high condition for this pin.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INEN</name>
          <description>GPIO Input Enable</description>
          <addressOffset>0x30</addressOffset>
        </register>
        <register>
          <name>INTEN</name>
          <description>GPIO Interrupt Enable Register. Each bit in this register controls the GPIO interrupt enable for the associated pin on the GPIO port.</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>GPIO_INTEN</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Interrupts are disabled for this GPIO pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Interrupts are enabled for this GPIO pin.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN_SET</name>
          <description>GPIO Interrupt Enable Set. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_INT_EN to 1, without affecting other bits in that register.</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>GPIO_INTEN_SET</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>set</name>
                  <description>Set GPIO_INT_EN bit in this position to '1'</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN_CLR</name>
          <description>GPIO Interrupt Enable Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_INT_EN to 0, without affecting other bits in that register.</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>GPIO_INTEN_CLR</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <description>No Effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Clear GPIO_INT_EN bit in this position to '0'</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFL</name>
          <description>GPIO Interrupt Status Register. Each bit in this register contains the pending interrupt status for the associated GPIO pin in this port.</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>GPIO_INTFL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <description>No Interrupt is pending on this GPIO pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An Interrupt is pending on this GPIO pin.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFL_CLR</name>
          <description>GPIO Status Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_INT_STAT to 0, without affecting other bits in that register.</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKEN</name>
          <description>GPIO Wake Enable Register. Each bit in this register controls the PMU wakeup enable for the associated GPIO pin in this port.</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>GPIO_WKEN</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>PMU wakeup for this GPIO is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>PMU wakeup for this GPIO is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WKEN_SET</name>
          <description>GPIO Wake Enable Set. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_WAKE_EN to 1, without affecting other bits in that register.</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKEN_CLR</name>
          <description>GPIO Wake Enable Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_WAKE_EN to 0, without affecting other bits in that register.</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DUALEDGE</name>
          <description>GPIO Interrupt Dual Edge Mode Register. Each bit in this register selects dual edge mode for the associated GPIO pin in this port.</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>GPIO_DUALEDGE</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <description>No Effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Dual Edge mode is enabled. If edge-triggered interrupts are enabled on this GPIO pin, then both rising and falling edges will trigger interrupts regardless of the GPIO_INT_POL setting.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
