pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
        <register>
          <name>PADCTRL0</name>
          <description>GPIO Input Mode Config 1. Each bit in this register enables the weak pull-up for the associated GPIO pin in this port.</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>GPIO_PADCTRL0</name>
              <description>The two bits in GPIO_PAD_CFG1 and GPIO_PAD_CFG2 for each GPIO pin work together to determine the pad mode when the GPIO is set to input mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>impedance</name>
                  <description>High Impedance.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pu</name>
                  <description>Weak pull-up mode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pd</name>
                  <description>weak pull-down mode.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADCTRL1</name>
          <description>GPIO Input Mode Config 2. Each bit in this register enables the weak pull-up for the associated GPIO pin in this port.</description>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>GPIO_PADCTRL1</name>
              <description>The two bits in GPIO_PAD_CFG1 and GPIO_PAD_CFG2 for each GPIO pin work together to determine the pad mode when the GPIO is set to input mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>impedance</name>
                  <description>High Impedance.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pu</name>
                  <description>Weak pull-up mode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pd</name>
                  <description>weak pull-down mode.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EN1</name>
          <description>GPIO Alternate Function Enable Register. Each bit in this register selects between primary/secondary functions for the associated GPIO pin in this port.</description>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>GPIO_EN1</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>primary</name>
                  <description>Primary function selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>secondary</name>
                  <description>Secondary function selected.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EN1_SET</name>
          <description>GPIO Alternate Function Set. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_EN1 to 1, without affecting other bits in that register.</description>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EN1_CLR</name>
          <description>GPIO Alternate Function Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_EN1 to 0, without affecting other bits in that register.</description>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EN2</name>
          <description>GPIO Alternate Function Enable Register. Each bit in this register selects between primary/secondary functions for the associated GPIO pin in this port.</description>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>GPIO_EN2</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>primary</name>
                  <description>Primary function selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>secondary</name>
                  <description>Secondary function selected.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EN2_SET</name>
          <description>GPIO Alternate Function 2 Set. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_EN2 to 1, without affecting other bits in that register.</description>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EN2_CLR</name>
          <description>GPIO Wake Alternate Function Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_EN2 to 0, without affecting other bits in that register.</description>
          <addressOffset>0x7C</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HYSEN</name>
          <description>GPIO Input Hysteresis Enable.</description>
          <addressOffset>0xA8</addressOffset>
          <fields>
            <field>
              <name>GPIO_HYSEN</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRSEL</name>
          <description>GPIO Slew Rate Enable Register.</description>
          <addressOffset>0xAC</addressOffset>
          <fields>
            <field>
              <name>GPIO_SRSEL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast Slew Rate selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOW</name>
                  <description>Slow Slew Rate selected.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DS0</name>
          <description>GPIO Drive Strength  Register. Each bit in this register selects the drive strength for the associated GPIO pin in this port. Refer to the Datasheet for sink/source current of GPIO pins in each mode.</description>
          <addressOffset>0xB0</addressOffset>
          <fields>
            <field>
              <name>GPIO_DS0</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ld</name>
                  <description>GPIO port pin is in low-drive mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hd</name>
                  <description>GPIO port pin is in high-drive mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DS1</name>
          <description>GPIO Drive Strength 1 Register. Each bit in this register selects the drive strength for the associated GPIO pin in this port. Refer to the Datasheet for sink/source current of GPIO pins in each mode.</description>
          <addressOffset>0xB4</addressOffset>
          <fields>
            <field>
              <name>GPIO_DS1</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PS</name>
          <description>GPIO Pull Select Mode.</description>
          <addressOffset>0xB8</addressOffset>
          <fields>
            <field>
              <name>ALL</name>
              <description>Mask of all of the pins on the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
