pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
      </registers>
    </peripheral>
    <!--GPIO0 Individual I/O for each GPIO-->
    <peripheral derivedFrom="GPIO0">
      <name>GPIO1</name>
      <description>Individual I/O for each GPIO 1</description>
      <baseAddress>0x40009000</baseAddress>
      <interrupt>
        <name>GPIO1</name>
        <description>GPIO1 IRQ</description>
        <value>25</value>
      </interrupt>
    </peripheral>
    <!--GPIO1 Individual I/O for each GPIO 1-->
    <peripheral>
      <name>I2C0</name>
      <description>Inter-Integrated Circuit.</description>
      <groupName>I2C</groupName>
      <baseAddress>0x4001D000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C0</name>
        <description>I2C0 IRQ</description>
        <value>13</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register0.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>I2C Enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable I2C.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>enable I2C.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MST_MODE</name>
              <description>Master Mode Enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>slave_mode</name>
                  <description>Slave Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>master_mode</name>
                  <description>Master Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GC_ADDR_EN</name>
              <description>General Call Address Enable.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Ignore Gneral Call Address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Acknowledge general call address.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRXM_EN</name>
              <description>Interactive Receive Mode.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable Interactive Receive Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable Interactive Receive Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRXM_ACK</name>
              <description>Data Acknowledge. This bit defines the acknowledge bit returned by the I2C receiver while IRXM = 1 HW forces ACK to 0 when IRXM = 0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ack</name>
                  <description>return ACK (pulling SDA LOW).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nack</name>
                  <description>return NACK (leaving SDA HIGH).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCL_OUT</name>
              <description>SCL Output. This bits control SCL output when SWOE =1.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>drive_scl_low</name>
                  <description>Drive SCL low. </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>release_scl</name>
                  <description>Release SCL.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDA_OUT</name>
              <description>SDA Output. This bits control SDA output when SWOE = 1. </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>drive_sda_low</name>
                  <description>Drive SDA low. </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>release_sda</name>
                  <description>Release SDA.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCL</name>
              <description>SCL status. This bit reflects the logic gate of SCL signal. </description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SDA</name>
              <description>SDA status. THis bit reflects the logic gate of SDA signal.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BB_MODE</name>
              <description>Software Output Enable.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>outputs_disable</name>
                  <description>I2C Outputs SCLO and SDAO disabled. </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>outputs_enable</name>
                  <description>I2C Outputs SCLO and SDAO enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ</name>
              <description>Read. This bit reflects the R/W bit of an address match (AMI = 1) or general call match (GCI = 1). This bit is valid 3 cycles after the relevant interrupt bit is set.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>write</name>
                  <description>Write.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read</name>
                  <description>Read.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSTR_DIS</name>
              <description>This bit will disable slave clock stretching when set.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>en</name>
                  <description>Slave clock stretching enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Slave clock stretching disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONE_MST_MODE</name>
              <description>SCL Push-Pull Mode. This bit controls whether SCL is operated in a the I2C standard open-drain mode, or in a non-standard push-pull mode where the Hi-Z output isreplaced with Drive-1. The non-standard mode should only be used when operating as a master and communicating with slaves that are guaranteed to never drive SCL low. </description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Standard open-drain operation:
					drive low for 0, Hi-Z for 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Non-standard push-pull operation:
					drive low for 0, drive high for 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HS_EN</name>
              <description>High speed mode enable</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>IRXM
    </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register.</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Bus Status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle</name>
                  <description>I2C Bus Idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>I2C Bus Busy.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_EM</name>
              <description>RX empty.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_empty</name>
                  <description>Not Empty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>empty</name>
                  <description>Empty.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FULL</name>
              <description>RX Full.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_full</name>
                  <description>Not Full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>full</name>
                  <description>Full.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_EM</name>
              <description>TX Empty.</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_empty</name>
                  <description>Not Empty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>empty</name>
                  <description>Empty.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_FULL</name>
              <description>TX Full.</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_empty</name>
                  <description>Not Empty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>empty</name>
                  <description>Empty.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MST_BUSY</name>
              <description>Clock Mode.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_actively_driving_scl_clock</name>
                  <description>Device not actively driving SCL clock cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>actively_driving_scl_clock</name>
                  <description>Device operating as master and actively driving SCL clock cycles.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
