pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
      </registers>
    </peripheral>
    <!--I2S Inter-IC Sound Interface.-->
    <peripheral>
      <name>ECC</name>
      <description>Error Correction Code</description>
      <baseAddress>0x40105400</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EN</name>
          <description>ECC Enable Register</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>RAM</name>
              <description>System RAM ECC Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICC0</name>
              <description>Instruction Cache 0 ECC Enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH</name>
              <description>Flash ECC Enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--ECC Error Correction Code-->
    <peripheral>
      <name>ICC0</name>
      <description>Instruction Cache Controller Registers</description>
      <baseAddress>0x4002A000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INFO</name>
          <description>Cache ID Register.</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RELNUM</name>
              <description>Release Number. Identifies the RTL release version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PARTNUM</name>
              <description>Part Number. This field reflects the value of C_ID_PART_NUMBER configuration parameter.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ID</name>
              <description>Cache ID. This field reflects the value of the C_ID_CACHEID configuration parameter.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SZ</name>
          <description>Memory Configuration Register.</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00080008</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <description>Cache Size. Indicates total size in Kbytes of cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>MEM</name>
              <description>Main Memory Size. Indicates the total size, in units of 128 Kbytes, of code memory accessible to the cache controller.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Cache Control and Status Register.</description>
          <addressOffset>0x0100</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Cache Enable. Controls whether the cache is bypassed or is in use. Changing the state of this bit will cause the instruction cache to be flushed and its contents invalidated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Cache Bypassed. Instruction data is stored in the line fill buffer but is not written to main cache memory array.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Cache Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY</name>
              <description>Cache Ready flag. Cleared by hardware when at any time the cache as a whole is invalidated (including a system reset). When this bit is 0, the cache is effectively in bypass mode (instruction fetches will come from main memory or from the line fill buffer). Set by hardware when the invalidate operation is complete and the cache is ready.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>notReady</name>
                  <description>Not Ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INVALIDATE</name>
          <description>Invalidate All Registers.</description>
          <addressOffset>0x0700</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INVALID</name>
              <description>Invalidate.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
