pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
      </registers>
    </peripheral>
    <!--RTC Real Time Clock and Alarm.-->
    <peripheral>
      <name>SIR</name>
      <description>System Initialization Registers.</description>
      <baseAddress>0x40000400</baseAddress>
      <access>read-only</access>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SIR_STATUS</name>
          <description>System Initialization Status Register.</description>
          <addressOffset>0x00</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CFG_VALID</name>
              <description>Configuration Valid Flag.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_ERR</name>
              <description>Configuration Error Flag.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIR_ADDR</name>
          <description>Read-only field set by the SIB block if a CRC error occurs during the read of the OTP memory. Contains the failing address in OTP memory (when CRCERR equals 1).</description>
          <addressOffset>0x04</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--SIR System Initialization Registers.-->
    <peripheral>
      <name>SPI0</name>
      <description>SPI peripheral.</description>
      <baseAddress>0x40046000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI0</name>
        <value>16</value>
      </interrupt>
      <registers>
        <register>
          <name>FIFO32</name>
          <description>Register for reading and writing the FIFO.</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Read to pull from RX FIFO, write to put into TX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>2</dimIncrement>
          <name>FIFO16[%s]</name>
          <description>Register for reading and writing the FIFO.</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Read to pull from RX FIFO, write to put into TX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>1</dimIncrement>
          <name>FIFO8[%s]</name>
          <description>Register for reading and writing the FIFO.</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>Read to pull from RX FIFO, write to put into TX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL0</name>
          <description>Register for controlling SPI peripheral.</description>
          <addressOffset>0x04</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>SPI Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>SPI is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>SPI is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MST_MODE</name>
              <description>Master Mode Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>SPI is Slave mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>SPI is  Master mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SS_IO</name>
              <description>Slave Select 0, IO direction, to support Multi-Master mode,Slave Select 0 can be input in Master mode. This bit has no effect in slave mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>output</name>
                  <description>Slave select 0 is output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>input</name>
                  <description>Slave Select 0 is input, only valid if MMEN=1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Start Transmit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>start</name>
                  <description>Master Initiates a transaction, this bit is self clearing when transactions are done. If a transaction cimpletes, and the TX FIFO is empty, the Master halts, if a transaction completes, and the TX FIFO is not empty, the Master initiates another transaction.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SS_CTRL</name>
              <description>Start Select Control. Used in Master mode to control the behavior of the Slave Select signal at the end of a transaction.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEASSERT</name>
                  <description>SPI De-asserts Slave Select at the end of a transaction.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERT</name>
                  <description>SPI leaves Slave Select asserted at the end of a transaction.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SS_ACTIVE</name>
              <description>Slave Select, when in Master mode selects which Slave devices are selected. More than one Slave device can be selected.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SS0</name>
                  <description>SS0 is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS1</name>
                  <description>SS1 is selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS2</name>
                  <description>SS2 is selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS3</name>
                  <description>SS3 is selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <description>Register for controlling SPI peripheral.</description>
          <addressOffset>0x08</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_NUM_CHAR</name>
              <description>Nubmer of Characters to transmit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RX_NUM_CHAR</name>
              <description>Nubmer of Characters to receive.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <description>Register for controlling SPI peripheral.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPHA</name>
              <description>Clock Phase.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Rising_Edge</name>
                  <description>Data Sampled on clock rising edge. Use when in SPI Mode 0 and Mode 2 </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Falling_Edge</name>
                  <description>Data Sampled on clock falling edge. Use when in SPI Mode 1 and Mode 3</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPOL</name>
              <description>Clock Polarity.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal Clock. Use when in SPI Mode 0 and Mode 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inverted</name>
                  <description>Inverted Clock. Use when in SPI Mode 2 and Mode 3</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMBITS</name>
              <description>Number of Bits per character.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>16 bits per character.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_WIDTH</name>
              <description>SPI Data width.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Mono</name>
                  <description>1 data pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Dual</name>
                  <description>2 data pins.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Quad</name>
                  <description>4 data pins.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THREE_WIRE</name>
              <description>Three Wire mode. MOSI/MISO pin (s) shared. Only Mono mode suports Four-Wire.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Use four wire mode (Mono only).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Use three wire mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SS_POL</name>
              <description>Slave Select Polarity, each Slave Select can have unique polarity.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SS0_high</name>
                  <description>SS0 active high.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS1_high</name>
                  <description>SS1 active high.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS2_high</name>
                  <description>SS2 active high.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS3_high</name>
                  <description>SS3 active high.</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSTIME</name>
          <description>Register for controlling SPI peripheral/Slave Select Timing.</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRE</name>
              <description>Slave Select Pre delay 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 system clocks between SS active and first serial clock edge.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POST</name>
              <description>Slave Select Post delay 2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 system clocks between last serial clock edge and SS inactive.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INACT</name>
              <description>Slave Select Inactive delay.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 system clocks between transactions.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCTRL</name>
          <description>Register for controlling SPI clock rate.</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>Low duty cycle control. In timer mode, reload[7:0].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Dis</name>
                  <description>Duty cycle control of serial clock generation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HI</name>
              <description>High duty cycle control. In timer mode, reload[15:8].</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Dis</name>
                  <description>Duty cycle control of serial clock generation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>System Clock scale factor. Scales the AMBA clock by 2^SCALE before generating serial clock.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
