pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
        <register>
          <name>WKFL</name>
          <description>Register for wake up flags. All bits in this register are write 1 to clear.</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_THD</name>
              <description>Wake on TX FIFO Threshold Crossed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Flag is set when value read is 1. Write 1 to clear this flag.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_EM</name>
              <description>Wake on TX FIFO Empty.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Flag is set when value read is 1. Write 1 to clear this flag.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_THD</name>
              <description>Wake on RX FIFO Threshold Crossed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Flag is set when value read is 1. Write 1 to clear this flag.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FULL</name>
              <description>Wake on RX FIFO Full.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Flag is set when value read is 1. Write 1 to clear this flag.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WKEN</name>
          <description>Register for wake up enable.</description>
          <addressOffset>0x2C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TX_THD</name>
              <description>Wake on TX FIFO Threshold Crossed Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Wakeup source disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Wakeup source enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_EM</name>
              <description>Wake on TX FIFO Empty Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Wakeup source disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Wakeup source enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_THD</name>
              <description>Wake on RX FIFO Threshold Crossed Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Wakeup source disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Wakeup source enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FULL</name>
              <description>Wake on RX FIFO Full Enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Wakeup source disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Wakeup source enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>SPI Status register.</description>
          <addressOffset>0x30</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>SPI active status. In Master mode, set when transaction starts, cleared when last bit of last character is acted upon and Slave Select de-assertion would occur. In Slave mode, set when Slave Select is asserted, cleared when Slave Select is de-asserted. Not used in Timer mode. </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>SPI not active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>active</name>
                  <description>SPI active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
