pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
        <register>
          <name>CTRL1</name>
          <description>Timer Configuration Register.</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKSEL_A</name>
              <description>Timer Clock Select for Timer A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CLKEN_A</name>
              <description>Timer A Enable Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKRDY_A</name>
              <description>CLK_TMR Ready Flag for Timer A</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVENT_SEL_A</name>
              <description>Event Select for Timer A</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>NEGTRIG_A</name>
              <description>Negative Edge Trigger for Event for Timer A</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE_A</name>
              <description>Interrupt Enable for Timer A</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPEVENT_SEL_A</name>
              <description>Capture Event Select for Timer A</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SW_CAPEVENT_A</name>
              <description>Software Capture Event for Timer A</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WE_A</name>
              <description>Wake-Up Enable for Timer A</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUTEN_A</name>
              <description>OUT_OE_O Enable for Modes 0, 1,and 5 for Timer A</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUTBEN_A</name>
              <description>PWM_CKB_EN_O Enable for Modes other than Mode 3 for Timer A</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKSEL_B</name>
              <description>Timer Clock Select for Timer B</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CLKEN_B</name>
              <description>Timer B Enable Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKRDY_B</name>
              <description>CLK_TMR Ready Flag for Timer B</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVENT_SEL_B</name>
              <description>Event Select for Timer B</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>NEGTRIG_B</name>
              <description>Negative Edge Trigger for Event for Timer B</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE_B</name>
              <description>Interrupt Enable for Timer B</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPEVENT_SEL_B</name>
              <description>Capture Event Select for Timer B</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SW_CAPEVENT_B</name>
              <description>Software Capture Event for Timer B</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WE_B</name>
              <description>Wake-Up Enable for Timer B</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CASCADE</name>
              <description>Cascade two 16-bit timers into one 32-bit timer. Only available when C_TMR16=0 adn C_DUALTMR16=1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKFL</name>
          <description>Timer Wakeup Status Register.</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>A</name>
              <description>Wake-Up Flag for Timer A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B</name>
              <description>Wake-Up Flag for Timer B</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--TMR Low-Power Configurable Timer-->
    <peripheral derivedFrom="TMR">
      <name>TMR1</name>
      <description>Low-Power Configurable Timer 1</description>
      <baseAddress>0x40011000</baseAddress>
      <interrupt>
        <name>TMR1</name>
        <description>TMR1 IRQ</description>
        <value>6</value>
      </interrupt>
    </peripheral>
    <!--TMR1 Low-Power Configurable Timer 1-->
    <peripheral derivedFrom="TMR">
      <name>TMR2</name>
      <description>Low-Power Configurable Timer 2</description>
      <baseAddress>0x40012000</baseAddress>
      <interrupt>
        <name>TMR2</name>
        <description>TMR2 IRQ</description>
        <value>7</value>
      </interrupt>
    </peripheral>
