pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
      </registers>
    </peripheral>
    <!--UART UART Low Power Registers-->
    <peripheral derivedFrom="UART">
      <name>UART1</name>
      <description>UART Low Power Registers 1</description>
      <baseAddress>0x40043000</baseAddress>
    </peripheral>
    <!--UART1 UART Low Power Registers 1-->
    <peripheral derivedFrom="UART">
      <name>UART2</name>
      <description>UART Low Power Registers 2</description>
      <baseAddress>0x40044000</baseAddress>
    </peripheral>
    <!--UART2 UART Low Power Registers 2-->
    <peripheral derivedFrom="UART">
      <name>UART3</name>
      <description>UART Low Power Registers 3</description>
      <baseAddress>0x40145000</baseAddress>
    </peripheral>
    <!--UART3 UART Low Power Registers 3-->
    <peripheral>
      <name>WDT</name>
      <description>Windowed Watchdog Timer</description>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x0400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WWDT</name>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Watchdog Timer Control Register.</description>
          <addressOffset>0x00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT_LATE_VAL</name>
              <description>Windowed Watchdog Interrupt Upper Limit. Sets the number of WDTCLK cycles until a windowed watchdog timer interrupt is generated (if enabled) if the CPU does not write the windowed watchdog reset sequence to the WWDT_RST register before the watchdog timer has counted this time period since the last timer reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wdt2pow31</name>
                  <description>2**31 clock cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow30</name>
                  <description>2**30 clock cycles.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow29</name>
                  <description>2**29 clock cycles.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow28</name>
                  <description>2**28 clock cycles.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow27</name>
                  <description>2^27 clock cycles.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow26</name>
                  <description>2**26 clock cycles.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow25</name>
                  <description>2**25 clock cycles.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow24</name>
                  <description>2**24 clock cycles.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow23</name>
                  <description>2**23 clock cycles.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow22</name>
                  <description>2**22 clock cycles.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow21</name>
                  <description>2**21 clock cycles.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow20</name>
                  <description>2**20 clock cycles.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow19</name>
                  <description>2**19 clock cycles.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow18</name>
                  <description>2**18 clock cycles.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow17</name>
                  <description>2**17 clock cycles.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow16</name>
                  <description>2**16 clock cycles.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_LATE_VAL</name>
              <description>Windowed Watchdog Reset Upper Limit. Sets the number of WDTCLK cycles until a system reset occurs (if enabled) if the CPU does not write the watchdog reset sequence to the WDT_RST register before the watchdog timer has counted this time period since the last timer reset.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wdt2pow31</name>
                  <description>2**31 clock cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow30</name>
                  <description>2**30 clock cycles.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow29</name>
                  <description>2**29 clock cycles.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow28</name>
                  <description>2**28 clock cycles.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow27</name>
                  <description>2^27 clock cycles.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow26</name>
                  <description>2**26 clock cycles.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow25</name>
                  <description>2**25 clock cycles.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow24</name>
                  <description>2**24 clock cycles.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow23</name>
                  <description>2**23 clock cycles.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow22</name>
                  <description>2**22 clock cycles.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow21</name>
                  <description>2**21 clock cycles.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow20</name>
                  <description>2**20 clock cycles.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow19</name>
                  <description>2**19 clock cycles.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow18</name>
                  <description>2**18 clock cycles.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow17</name>
                  <description>2**17 clock cycles.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow16</name>
                  <description>2**16 clock cycles.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>Windowed Watchdog Timer Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_LATE</name>
              <description>Windowed Watchdog Timer Interrupt Flag Too Late.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT_INT_EN</name>
              <description>Windowed Watchdog Timer Interrupt Enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT_RST_EN</name>
              <description>Windowed Watchdog Timer Reset Enable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EARLY</name>
              <description>Windowed Watchdog Timer Interrupt Flag Too Soon.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT_EARLY_VAL</name>
              <description>Windowed Watchdog Interrupt Lower Limit. Sets the number of WDTCLK cycles that establishes the lower boundary of the watchdog window. A windowed watchdog timer interrupt is generated (if enabled) if the CPU writes the windowed watchdog reset sequence to the WWDT_RST register before the watchdog timer has counted this time period since the last timer reset.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wdt2pow31</name>
                  <description>2**31 clock cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow30</name>
                  <description>2**30 clock cycles.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow29</name>
                  <description>2**29 clock cycles.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow28</name>
                  <description>2**28 clock cycles.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow27</name>
                  <description>2^27 clock cycles.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow26</name>
                  <description>2**26 clock cycles.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow25</name>
                  <description>2**25 clock cycles.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow24</name>
                  <description>2**24 clock cycles.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow23</name>
                  <description>2**23 clock cycles.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow22</name>
                  <description>2**22 clock cycles.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow21</name>
                  <description>2**21 clock cycles.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow20</name>
                  <description>2**20 clock cycles.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow19</name>
                  <description>2**19 clock cycles.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow18</name>
                  <description>2**18 clock cycles.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow17</name>
                  <description>2**17 clock cycles.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow16</name>
                  <description>2**16 clock cycles.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_EARLY_VAL</name>
              <description>Windowed Watchdog Reset Lower Limit. Sets the number of WDTCLK cycles that establishes the lower boundary of the watchdog window. A system reset occurs (if enabled) if the CPU writes the windowed watchdog reset sequence to the WWDT_RST register before the watchdog timer has counted this time period since the last timer reset.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wdt2pow31</name>
                  <description>2**31 clock cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow30</name>
                  <description>2**30 clock cycles.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow29</name>
                  <description>2**29 clock cycles.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow28</name>
                  <description>2**28 clock cycles.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow27</name>
                  <description>2^27 clock cycles.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow26</name>
                  <description>2**26 clock cycles.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow25</name>
                  <description>2**25 clock cycles.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow24</name>
                  <description>2**24 clock cycles.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow23</name>
                  <description>2**23 clock cycles.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow22</name>
                  <description>2**22 clock cycles.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow21</name>
                  <description>2**21 clock cycles.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow20</name>
                  <description>2**20 clock cycles.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow19</name>
                  <description>2**19 clock cycles.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow18</name>
                  <description>2**18 clock cycles.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow17</name>
                  <description>2**17 clock cycles.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wdt2pow16</name>
                  <description>2**16 clock cycles.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKRDY_IE</name>
              <description>Switch Ready Interrupt Enable. Fires an interrupt when it is safe to swithc the clock.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKRDY</name>
              <description>Clock Status.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIN_EN</name>
              <description>Enables the Windowed Watchdog Function.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Windowed Mode Disabled (i.e. Compatibility Mode).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Windowed Mode Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_EARLY</name>
              <description>Windowed Watchdog Timer Reset Flag Too Soon.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_LATE</name>
              <description>Windowed Watchdog Timer Reset Flag Too Late.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>noEvent</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
