pyocd/pyOCD/pyocd/debug/svd/data/max32670.svd
        <register>
          <name>RST</name>
          <description>Windowed Watchdog Timer Reset Register.</description>
          <addressOffset>0x04</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>RESET</name>
              <description>Writing the watchdog counter 'reset sequence' to this register resets the watchdog counter. If the watchdog count exceeds INT_PERIOD_UPPER_LIMIT then a watchdog interrupt will occur, if enabled. If the watchdog count exceeds RST_PERIOD_UPPER_LIMIT then a watchdog reset will occur, if enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>seq0</name>
                  <description>The first value to be written to reset the WDT.</description>
                  <value>0x000000A5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>seq1</name>
                  <description>The second value to be written to reset the WDT.</description>
                  <value>0x0000005A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSEL</name>
          <description>Windowed Watchdog Timer Clock Select Register.</description>
          <addressOffset>0x08</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>WWDT Clock Selection Register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>Windowed Watchdog Timer Count Register.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Current Value of the Windowed Watchdog Timer Counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--WDT Windowed Watchdog Timer-->
    <peripheral derivedFrom="WDT">
      <name>WDT1</name>
      <description>Windowed Watchdog Timer 1</description>
      <baseAddress>0x40003400</baseAddress>
      <interrupt>
        <name>WDT1</name>
        <description>WDT1 IRQ</description>
        <value>57</value>
      </interrupt>
    </peripheral>
    <!--WDT1 Windowed Watchdog Timer 1-->
  </peripherals>
</device>